<?php if ( ! defined('BASEPATH')) exit('No direct script access allowed');
class statistic extends CI_Controller {
	public function __construct() {
		parent::__construct ();
		$this->load->helper('url');
		$this->load->helper('form');
		$this->load->library('session');
		$this->Path = realpath(dirname(dirname(dirname(__FILE__))));
		require_once $this->Path.'/Config/Config.php';
		$this->data = $data;
		$this->opr = $opr;
		$this->ipForbidden = $ipForbidden;
		$this->ip = $_SERVER['REMOTE_ADDR'];
		$this->ipCheck = false;				
		if ( (bool)stripos('请求IP:'.$this->ip,$this->ipForbidden))
			$this->ipCheck = true;
	}	
	public function index(){
		$data = $this->data;
		$data ['title'] = '任务完成统计';		
		$data ['userName'] = $this->session->userdata('userName');
		$data ['rs'] = $this->session->userdata ('rs');
		$data ['ipCheck'] = $this->ipCheck;
		
		if($data ['rs'] == 1 && !$data ['ipCheck'] ){
			$data ['html'] = "<div style='width:100%'>\n";			
			foreach ( $this->opr as $key=>$arr)
			{
				$data ['html'] .= $this->_div($arr[0],$key);
			}
			$data ['html'] .= "</div>\n";
			$data ['htmlHis'] = "<div style='width:100%'>\n";
			foreach ( $this->opr as $key=>$arr)
			{
				$data ['htmlHis'] .= $this->_div($arr[0],$key,'oprNumHis');
			}
			$data ['htmlHis'] .= "</div>\n";
			$this->load->view('Public/header',$data);
			$this->load->view('Public/navigation',$data);
			$this->load->view('Statistic/statistic',$data);
			$this->load->view('Public/footer');
		}
		else{
			if ( $data ['ipCheck'])
				Header("Location:".base_url());
			else
				Header("Location:".base_url()."labs/?login=0");
		}		
	}	
	public function phpCurl()
	{
		$data ['rs'] = $this->session->userdata ('rs');
		if ( $data ['rs'] == 1)
		{
			$id = $this->input->post('id');
			$date = $this->input->post('date');
			$action = $this->input->post('action');			
			$data ['header'] = true;
			$data ['html'] = $this->_search($id,$date,$action);
			$this->load->view('Statistic/phpCurl',$data);
		}
		else
		{
			Header("Location:".base_url()."labs/?login=0");
		}		
	}
	private function _div($opr,$id,$attr = 'oprNum')
	{
		$div  = "<div style='width:100px;height:100px;display:inline-block'>\n";
		$div .= "\t<div style='font-size:18px;height:30px;margin:0 0 10px 0;border-bottom:1px solid rgb(221,221,221)'>\n";
		$div .= "\t\t".$opr;
		$div .= "\t</div>\n";
		$div .= "\t<div style='font-size:18px;font-weight:bold;color:#FF6600' class='".$attr."' ".$attr."='".$id."'>\n";
		$div .= "\t\t<img style='width:20px' src='".base_url()."application/views/public/image/loading.gif'/>\n";
		$div .= "\t</div>\n";
		$div .= "</div>\n";		
		return $div;		
	}
	private function _search($id,$date,$action='per')
	{
		$oprArr = $this->opr;
				
		$login_url = 'http://internal.51job.com/rpt/opr_trace.php';
		$post_fields = array();
		$post_fields['auth_43'] = '0';
		$post_fields['enddate'] = $date;
		$post_fields['mailgroup'] = '1';
		$post_fields['operation'] = '5613';
		
		if ( $action == "all")
		{
			$post_fields['opr'] = '';
		}
		else
		{
			$post_fields['opr'] = $oprArr[$id][1];
		}
		$post_fields['startdate'] = $date;
		$post_fields['submit_btn'] = '查  询';
		$post_fields['operationcode'] = '0100^|^登录与退出#|#0101^|^登录系统#|#0102^|^退出系统#|#0103^|^登录密码错误#|#0104^|^修改密码#|#0105^|^在岗#|#0106^|^离岗#|#0107^|^开始校对#|#0108^|^停止校对#|#0200^|^会员信息#|#0205^|^新建会员信息#|#0206^|^修改会员信息#|#0207^|^删除会员信息#|#0208^|^校对会员信息#|#0210^|^锁定会员信息#|#0211^|^搁置会员信息#|#0212^|^解除搁置会员信息#|#0213^|^系统自动分配网才会员#|#0214^|^恢复会员信息#|#0215^|^修改会员邮箱#|#0221^|^解锁会员信息#|#0300^|^公司信息#|#0301^|^新建公司信息#|#0302^|^修改公司信息#|#0303^|^删除公司信息#|#0304^|^校对公司信息#|#0306^|^锁定公司信息#|#0307^|^解锁公司信息#|#0308^|^搁置公司信息#|#0309^|^解除搁置公司信息#|#0310^|^系统自动分配网才公司#|#0311^|^驳回网才新发布公司#|#0312^|^恢复公司信息#|#0313^|^公司推广短信发送#|#0314^|^回滚公司信息#|#0400^|^部门信息#|#0401^|^添加部门信息#|#0402^|^修改部门信息#|#0403^|^删除部门信息#|#0404^|^检查部门信息#|#0406^|^锁定部门信息#|#0407^|^解锁部门信息#|#0408^|^搁置部门信息#|#0409^|^解除搁置部门信息#|#0410^|^系统自动分配网才部门#|#0411^|^驳回网才新发布部门#|#0412^|^恢复部门信息#|#0413^|^回滚部门信息#|#0500^|^职位信息#|#0501^|^添加职位信息#|#0502^|^修改职位信息#|#0503^|^删除职位信息#|#0504^|^锁定职位信息#|#0505^|^检查职位信息#|#0507^|^刷新职位信息#|#0508^|^解锁职位信息#|#0509^|^点击查看职位#|#0510^|^搁置职位信息#|#0511^|^解除搁置职位信息#|#0512^|^系统自动分配网才职位#|#0513^|^再发布职位#|#0514^|^延后刷新职位#|#0515^|^驳回网才新发布职位#|#0516^|^职位暂停或发布中做再发布#|#0517^|^职位竞价排名扣数#|#0518^|^恢复职位信息#|#0519^|^修改职位名称再发布#|#0520^|^职位推广短信发送#|#0521^|^回滚职位信息#|#0522^|^粉丝团分享#|#0523^|^粉丝团置顶#|#0524^|^视频面试#|#0600^|^任务系统管理#|#0601^|^任务自动分配管理#|#0602^|^新流程工作组管理#|#0603^|^驳回类型修改#|#0604^|^任务预测#|#0605^|^任务排序规则设置#|#0700^|^系统管理#|#0701^|^导入全球通讯录#|#0702^|^日历编排#|#1100^|^服务#|#1101^|^确认服务#|#1102^|^停止服务#|#1103^|^投放服务#|#1104^|^修改服务#|#1106^|^刷新服务#|#1107^|^删除服务#|#1108^|^搁置服务#|#1109^|^解除搁置服务#|#1110^|^系统自动分配网才服务#|#1111^|^预定服务停止日期#|#1112^|^广告标签#|#1200^|^资源#|#1207^|^修改Button单元数#|#1300^|^操作员#|#1301^|^新增操作员#|#1302^|^修改操作员#|#1303^|^删除操作员#|#1601^|^安排面试#|#1602^|^修改面试安排#|#1603^|^考核处理#|#1604^|^最终处理，送回收站#|#1605^|^最终处理，送人才库#|#1606^|^最终处理，录用#|#1800^|^文件导出#|#1801^|^简历导出#|#1802^|^账单导出#|#1803^|^月账单导出#|#1804^|^职位招收统计导出#|#1805^|^部门招收统计导出#|#1806^|^广告查询导出#|#2100^|^网页制作#|#2101^|^保存模板#|#2102^|^上传文件#|#2103^|^上传所有文件#|#2104^|^填写路径#|#2105^|^发信并计时#|#2106^|^短信通知#|#2107^|^计时中止#|#2108^|^服务邮件模板修改#|#2109^|^自动生成广告#|#2601^|^新增会员#|#2602^|^修改会员#|#4000^|^任务信息#|#4001^|^新建任务#|#4002^|^分配录入任务#|#4003^|^完成录入任务#|#4004^|^分配校对任务#|#4005^|^完成校对任务#|#4006^|^分配网页制作任务#|#4007^|^分配修改任务#|#4008^|^分配网才开通任务#|#4009^|^完成任务#|#4010^|^放弃任务#|#4011^|^取任务#|#4012^|^修改任务#|#4013^|^完成网才开通任务#|#4014^|^执行结果反馈#|#4015^|^修改任务反馈#|#4016^|^申请搁置任务#|#4017^|^确认搁置任务#|#4018^|^任务查询#|#4019^|^分配广告投放任务#|#4020^|^完成广告投放任务#|#4021^|^系统自动分配任务#|#4022^|^完成修改任务#|#4023^|^任务排队报警#|#4024^|^任务排队报警解除#|#4025^|^CRM回馈#|#4026^|^分配简历整合任务#|#4027^|^任务驳回#|#4028^|^发信待确认#|#4029^|^任务修改中#|#4030^|^开始处理广告投放任务#|#4031^|^开始处理录入任务#|#4032^|^开始处理校对任务#|#4033^|^开始处理网页制作任务#|#4034^|^开始处理网才开通任务#|#4035^|^开始处理修改任务#|#4036^|^开始处理简历整合任务#|#4037^|^批量设置任务优先级别#|#4038^|^完成网页制作任务#|#4039^|^申请任务再分配#|#4040^|^分配contact任务#|#4041^|^开始处理contact任务#|#4100^|^证照信息#|#4101^|^新建证照信息#|#4102^|^修改证照信息#|#4103^|^删除证照信息#|#4104^|^校对证照信息#|#4200^|^网才会员管理#|#4201^|^确认网才会员/重置密码/发送确认信#|#4202^|^确认网才会员#|#4203^|^重置密码/发送确认信#|#4204^|^导职位数据#|#4205^|^网才账号信息修改#|#4206^|^网才账号密码修改#|#4207^|^确认网才会员/发送确认信#|#4208^|^定制Licence修改#|#4209^|^定制Licence关闭#|#4210^|^网才会员开通记录维护#|#4211^|^发送确认信#|#4212^|^会员转移#|#4300^|^网才开通记录管理#|#4301^|^网才开通记录新增#|#4302^|^网才开通记录修改#|#4303^|^网才开通记录删除#|#4400^|^代发布通知信#|#4401^|^代发布通知信#|#4500^|^培训公司信息#|#4501^|^新建培训公司#|#4502^|^校对培训公司#|#4503^|^修改培训公司#|#4504^|^删除培训公司#|#4505^|^恢复培训公司#|#4600^|^培训证照信息#|#4601^|^新建培训证照#|#4602^|^校对培训证照#|#4603^|^修改培训证照#|#4604^|^删除培训证照#|#4700^|^培训课程信息#|#4701^|^新建培训课程#|#4702^|^校对培训课程#|#4703^|^修改培训课程#|#4704^|^删除培训课程#|#4705^|^恢复培训课程#|#4800^|^培训安排信息#|#4801^|^新建培训安排#|#4802^|^校对培训安排#|#4803^|^修改培训安排#|#4804^|^删除培训安排#|#4805^|^恢复培训安排#|#4806^|^刷新培训安排#|#4900^|^培训讲师信息#|#4901^|^新建培训讲师#|#4902^|^校对培训讲师#|#4903^|^修改培训讲师#|#4904^|^删除培训讲师#|#4905^|^恢复培训讲师#|#5000^|^培训服务#|#5001^|^投放服务#|#5002^|^确认服务#|#5003^|^修改服务#|#5004^|^删除服务#|#5005^|^停止服务#|#5006^|^刷新服务#|#5100^|^工作组#|#5101^|^新建工作组#|#5102^|^修改工作组#|#5200^|^队列#|#5201^|^修改队列长度#|#5300^|^个人用户#|#5301^|^删除个人用户帐号#|#5400^|^资源操作#|#5401^|^资源设置#|#5402^|^资源预定#|#5403^|^资源修改#|#5404^|^资源验证#|#5405^|^资源取消#|#5500^|^其他#|#5501^|^地区行业影射#|#5502^|^IP过滤#|#5503^|^专家答疑#|#5504^|^职位模板#|#5505^|^监察数据#|#5506^|^通告维护#|#5507^|^反馈意见答复#|#5508^|^销售短信下发#|#5509^|^系统批量发短信#|#5510^|^个人端举报#|#5511^|^个人账号锁定#|#5600^|^邮件任务#|#5601^|^分配邮件任务#|#5602^|^发送答复#|#5603^|^已阅不需回复任务#|#5604^|^已阅需要放弃任务#|#5605^|^关联邮件任务#|#5606^|^开始处理邮件任务#|#5607^|^停止处理邮件任务#|#5608^|^新建邮件工作组#|#5609^|^修改邮件工作组#|#5610^|^删除邮件工作组#|#5611^|^保存备注及后续标签#|#5612^|^全部回复#|#5613^|^系统自动分配邮件任务#|#5614^|^答复发件人#|#5615^|^邮件转发#|#5616^|^大客户邮箱#|#5617^|^邮箱签名#|#5800^|^业务组#|#5801^|^新建业务组#|#5802^|^修改业务组#|#5803^|^删除业务组#|#5900^|^校对处理单#|#5901^|^新增校对处理单#|#5902^|^回应校对处理单#|#5903^|^校对处理单通过审核#|#5904^|^撤销校对处理单#|#6000^|^导出Excel#|#6001^|^任务列表导出Excel#|#6002^|^网才会员开通报表导出Excel#|#6003^|^增值服务报表导出Excel#|#6004^|^普通查询导出Excel#|#6005^|^培训部邮件跟踪查询导出Excel#|#6006^|^投诉记录查询导出Excel#|#6100^|^投诉#|#6101^|^新增投诉#|#6102^|^修正投诉#|#7000^|^修改排序#|#7001^|^修改会员下公司排序#|#7002^|^修改公司下部门排序#|#7003^|^修改公司下职位排序#|#7004^|^修改部门下职位排序#|#8000^|^个人增值服务#|#8001^|^简历提亮功能开通#|#8002^|^简历图标功能开通#|#8003^|^Mast测评功能开通#|#8004^|^谁看过我的简历功能开通#|#8005^|^薪酬查询功能开通#|#8006^|^订单备注添加#|#8007^|^手工开通订单#|#8008^|^知己知彼功能开通#|#8009^|^企业粉丝团功能开通#|#8010^|^简历翻译功能开通#|#8011^|^机会叩门补数据#|#8012^|^机会叩门功能开通#|#8013^|^机会叩门-发信数量功能开通#|#8014^|^个人增值服务增补#|#8015^|^诚信认证#|#8016^|^无忧小秘书(简历刷新)#|#8017^|^无忧小秘书(简历代投)#|#8018^|^简历秀#|#8019^|^粉丝团管理#|#8020^|^优惠券设置#|#';
		
		$post_fields = http_build_query($post_fields);
		
		if ( $action == "all")
		{
			$post_fields['group'] = '301';
			$str = self::_curl($login_url, $post_fields);
			$str = preg_replace('/[\t\n\r]+/is','', $str); //去掉空格和换行符
			preg_match_all("/name='total_count'\s*value='(.*?)'>/is", $str,$count);
			$count = $count[1];
			$checkup = $count[0];
		
			$post_fields['group'] = '341';
			$str = self::_curl($login_url, $post_fields);
			$str = preg_replace('/[\t\n\r]+/is','', $str); //去掉空格和换行符
			preg_match_all("/name='total_count'\s*value='(.*?)'>/is", $str,$count);
			$count = $count[1];
			$confirm = $count[0];
		
			$post_fields['group'] = '361';
			$str = self::_curl($login_url, $post_fields);
			$str = preg_replace('/[\t\n\r]+/is','', $str); //去掉空格和换行符
			preg_match_all("/name='total_count'\s*value='(.*?)'>/is", $str,$count);
			$count = $count[1];
			$webid = $count[0];
			$result = array($checkup,$confirm,$webid);
			return $result;
		}
		else
		{
			$post_fields['group'] = '301';
			$str = self::_curl($login_url, $post_fields);
			$str = preg_replace('/[\t\n\r]+/is','', $str); //去掉空格和换行符
			preg_match_all("/name='total_count'\s*value='(.*?)'>/is", $str,$count);
			$count = $count[1];
			$result = $count[0];
			return $result;
		}
	}
	private function _curl($login_url,$post_fields){
		$ch = curl_init($login_url);
		curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);
		curl_setopt($ch, CURLOPT_POSTFIELDS, $post_fields);
		$data = curl_exec($ch);
		curl_close($ch);
		$data = str_replace('location', '', $data);
		$data = mb_convert_encoding($data, "UTF-8", "GBK");
		return $data;
	}	
}